In [1]:
#pip install mysql-connector-python

import mysql.connector

In [13]:
db_connection = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password = 'admin'

)
print(db_connection)
mycurson = db_connection.cursor()

<mysql.connector.connection_cext.CMySQLConnection object at 0x000001B2C06DDF90>

In [10]:
mycurson.execute("CREATE DATABASE Pregrad_student")

In [14]:
mycurson.execute("SHOW DATABASES")
for i in mycurson:
    print(i)

('classicmodels',)
('information_schema',)
('library',)
('mysql',)
('mystudent',)
('performance_schema',)
('pregrad',)
('pregrad_student',)
('sakila',)
('student',)
('sys',)
('world',)

In [23]:
db_connection = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password = 'admin',
    database ='pregrad_student'

)
print(db_connection)
mycursor = db_connection.cursor()

<mysql.connector.connection_cext.CMySQLConnection object at 0x000001B2C078ED10>

In [16]:
mycursor.execute("CREATE TABLE student (name varchar(50), mobile INT, age INT)")

In [17]:
mycursor.execute("SHOW TABLES")
for i in mycursor:
    print(i)

('student',)

In [19]:
mycursor.execute("ALTER TABLE student ADD id INT AUTO_INCREMENT PRIMARY KEY")

In [24]:
query = "INSERT INTO student (name,mobile,age) VALUE (%s,%s,%s)"
val = ('ALok','8005086600','35')
mycursor.execute(query,val)
db_connection.commit()
print(mycursor.rowcount,"record inserted")

1 record inserted

In [22]:
db_connection.close()

In [29]:
ql = "INSERT INTO student (name, mobile) VALUES (%s, %s)"
val = [
  ('Peter', 'L 4'),
  ('Amy', 'A652'),
  ('Hannah', '21'),
  ('Michael', 'V345'),
  ('Sandy', 'O2'),
  ('Betty', 'G 1'),
  ('Richard', 'S331'),

]

mycursor.executemany(ql, val)

db_connection.commit()

print(mycursor.rowcount, "was inserted.")

7 was inserted.

In [30]:
mycursor.execute("SELECT * FROM student")
myresult = mycursor.fetchall()

for i in myresult:
    print(i)

('ALok', '8005086600', '35', 1)
('Peter', 'L 4', None, 2)
('Amy', 'A652', None, 3)
('Hannah', '21', None, 4)
('Michael', 'V345', None, 5)
('Sandy', 'O2', None, 6)
('Betty', 'G 1', None, 7)
('Richard', 'S331', None, 8)

In [31]:
#pip install SQLAlchemy
from sqlalchemy import create_engine

engine = create_engine('mysql+mysqlconnector://root:admin@localhost:3306/classicmodels')

In [33]:
import pandas as pd

In [35]:
df = pd.read_sql_table('customers',engine)

In [36]:
df.head()

,customerNumber,customerName,contactLastName,contactFirstName,phone,addressLine1,addressLine2,city,state,postalCode,country,salesRepEmployeeNumber,creditLimit
0,103,Atelier graphique,Schmitt,Carine,40.32.2555,"54, rue Royale",None,Nantes,None,44000,France,1370.0,21000.0
1,112,Signal Gift Stores,King,Jean,7025551838,8489 Strong St.,None,Las Vegas,NV,83030,USA,1166.0,71800.0
2,114,"Australian Collectors, Co.",Ferguson,Peter,03 9520 4555,636 St Kilda Road,Level 3,Melbourne,Victoria,3004,Australia,1611.0,117300.0
3,119,La Rochelle Gifts,Labrune,Janine,40.67.8555,"67, rue des Cinquante Otages",None,Nantes,None,44000,France,1370.0,118200.0
4,121,Baane Mini Imports,Bergulfsen,Jonas,07-98 9555,Erling Skakkes gate 78,None,Stavern,None,4110,Norway,1504.0,81700.0

In [37]:
import sqlite3

In [38]:
try:

	# Connect to DB and create a cursor
	sqliteConnection = sqlite3.connect('sql.db')
	cursor = sqliteConnection.cursor()
	print('DB Init')

	# Write a query and execute it with cursor
	query = 'select sqlite_version();'
	cursor.execute(query)

	# Fetch and output result
	result = cursor.fetchall()
	print('SQLite Version is {}'.format(result))

	# Close the cursor
	cursor.close()

# Handle errors
except sqlite3.Error as error:
	print('Error occurred - ', error)

# Close DB Connection irrespective of success
# or failure
finally:

	if sqliteConnection:
		sqliteConnection.close()
		print('SQLite Connection closed')

DB Init
SQLite Version is [('3.45.3',)]
SQLite Connection closed

In [39]:
# importing sqlite3 module
import sqlite3


# create connection by using object
# to connect with hotel_data database
connection = sqlite3.connect('hotel_data.db')

# query to create a table named FOOD1
connection.execute(''' CREATE TABLE hotel
		(FIND INT PRIMARY KEY	 NOT NULL,
		FNAME		 TEXT NOT NULL,
		COST		 INT	 NOT NULL,
		WEIGHT	 INT);
		''')

# insert query to insert food details in 
# the above table
connection.execute("INSERT INTO hotel VALUES (1, 'cakes',800,10 )")
connection.execute("INSERT INTO hotel VALUES (2, 'biscuits',100,20 )")
connection.execute("INSERT INTO hotel VALUES (3, 'chocos',1000,30 )")


print("All data in food table\n")

# create a cousor object for select query
cursor = connection.execute("SELECT * from hotel ")

# display all data from hotel table
for row in cursor:
	print(row)

All data in food table

(1, 'cakes', 800, 10)
(2, 'biscuits', 100, 20)
(3, 'chocos', 1000, 30)

In [40]:
# Import module 
import sqlite3 

# Connecting to sqlite 
conn = sqlite3.connect('alokdb.db') 

# Creating a cursor object using the 
# cursor() method 
cursor = conn.cursor() 

# Creating table 
table ="""CREATE TABLE STUDENT(NAME VARCHAR(255), CLASS VARCHAR(255), 
SECTION VARCHAR(255));"""
cursor.execute(table) 

# Queries to INSERT records. 
cursor.execute('''INSERT INTO STUDENT VALUES ('Raju', '7th', 'A')''') 
cursor.execute('''INSERT INTO STUDENT VALUES ('Shyam', '8th', 'B')''') 
cursor.execute('''INSERT INTO STUDENT VALUES ('Baburao', '9th', 'C')''') 

# Display data inserted 
print("Data Inserted in the table: ") 
data=cursor.execute('''SELECT * FROM STUDENT''') 
for row in data: 
	print(row) 

# Commit your changes in the database	 
conn.commit() 

# Closing the connection 
conn.close()

Data Inserted in the table:
('Raju', '7th', 'A')
('Shyam', '8th', 'B')
('Baburao', '9th', 'C')

In [42]:
# Connecting to sqlite 
conn = sqlite3.connect('alokdb.db') 

# Creating a cursor object using the 
# cursor() method 
cursor = conn.cursor() 
df1= pd.read_sql_table('STUDENT',conn)

NotImplementedError: